Leminuos/redirect_to_ram/HAL/src/stm32_hal_usb.c
    /*Endpoint IN Descriptor*/
    0x07,   /* bLength: Endpoint Descriptor size */
    ENDPOINT_TYPE,      /* bDescriptorType: Endpoint */
    CDC_IN_EP,                         /* bEndpointAddress */
    0x02,                              /* bmAttributes: Bulk */
    LOBYTE(CDC_DATA_FS_MAX_PACKET_SIZE),  /* wMaxPacketSize: */
    HIBYTE(CDC_DATA_FS_MAX_PACKET_SIZE),
    0x00                               /* bInterval: ignore for Bulk transfer */
};
#endif

#ifdef SUPPORT_USB_HID
static uint8_t ConfigDesc[] = {
    /*Configuration Descriptor*/
    MAX_SIZE_CONFIG_DESCRIPTOR, /* bLength: Configuration Descriptor size */
    CONFIGURATION_TYPE,         /* bDescriptorType: Configuration */
    USB_CONFIG_DESC_LEN,        /* wTotalLength:no of returned bytes */
    0x00,
    0x01,                       /* bNumInterfaces: 1 interface */
    0x01,                       /* bConfigurationValue:  Value to use as an argument to the
                                   SetConfiguration() request to select this configuration */
    0x00,                       /* iConfiguration: Index of string descriptor describing the configuration */
    0x80,                       /* bmAttributes */
    0xFA,                       /* MaxPower */

    /* Interface Descriptor */
    0x09,                       /* bLength: Interface Descriptor size */
    INTERFACE_TYPE,             /* bDescriptorType: */
    0x00,                       /* bInterfaceNumber: Number of Interface */
    0x00,                       /* bAlternateSetting: Alternate setting */
    0x01,                       /* bNumEndpoints */
    0x03,                       /* bInterfaceClass */
    0x01,                       /* bInterfaceSubClass */
    0x01,                       /* bInterfaceProtocol */
    0x00,                       /* iInterface: */

    /* HID Descriptor */
    0x09,                    // bLength
    0x21,                    // bDescriptorType (HID)
    0x11, 0x01,              // bcdHID 1.11
    0x00,                    // bCountryCode
    0x01,                    // bNumDescriptors
    0x22,                    // bDescriptorType (Report)
    LOBYTE(MAX_SIZE_REPORT_DESCRIPTOR), // wDescriptorLength
    HIBYTE(MAX_SIZE_CONFIG_DESCRIPTOR),

	/* Endpoint In Descriptor */
    0x07,                       /* bLength: Endpoint Descriptor size */
    ENDPOINT_TYPE,              /* bDescriptorType: Endpoint */
    HID_IN_EP,                  /* bEndpointAddress */
    0x03,                       /* bmAttributes: Interrupt */
    HID_MAX_SIZE_REPORT,        /* wMaxPacketSize */
    0x00,
    0x0A,                       /* bInterval */
};
#endif /* SUPPORT_USB_HID */

static inline void SetMaxPacketOutEP(uint8_t ep, uint16_t maxPacket)
{
    if (ep > 0x0F) return;

    maxPacketOutEP[ep] = maxPacket;
}

static inline uint16_t GetMaxPacketOutEP(uint8_t ep)
{
    if (ep > 0x0F) return 0;

    return maxPacketOutEP[ep];
}

uint8_t USB_ENUM_OK;

// Read Packet Buffer Memory Address
static void USB_ReadPMA(USB_Typedef* USBx , uint16_t wBufAddrPMA, uint8_t* buff, uint16_t wCount)
{
    uint32_t index          = 0;
    uint32_t nCount         = (wCount + 1) >> 1;
    uint32_t* pBufAddrAPB   = 0;

    pBufAddrAPB = (uint32_t*) (wBufAddrPMA*2 + (uint32_t) USBx + 0x400);

    for (index = 0; index < nCount; ++index)
    {
        *((uint16_t*) buff) = *((uint16_t*) pBufAddrAPB);
        pBufAddrAPB++;
        buff = buff + 2;
    }
}

// Write Packet Buffer Memory Address 
static void USB_WritePMA(USB_Typedef* USBx, uint16_t wBufAddrPMA, uint8_t* buff, uint16_t wCount)
{
    uint32_t index          = 0;
    uint32_t nCount         = (wCount + 1) >> 1;
    uint16_t *pBufAddrAPB   = 0, temp1, temp2;

    pBufAddrAPB = (uint16_t*) (wBufAddrPMA*2 + (uint32_t) USBx + 0x400);

    if (buff == NULL) return;

    for (index = 0; index < nCount; ++index)
    {
        temp1 = (uint16_t) (*buff);
        buff++;
        temp2 = temp1 | (((uint16_t) (*buff)) << 8);
        *pBufAddrAPB = temp2;
        pBufAddrAPB = pBufAddrAPB + 2;
        buff++;
    }
}

static uint8_t USBD_GetLen(uint8_t *desc)
{
    uint8_t len = 0;

    while (*desc != '\0')
    {
        ++len;
        ++desc;
    }

    return len;
}

static void USB_GetString(uint8_t *desc, uint8_t *unicode, uint16_t *len)
{
    uint8_t idx = 0;
  
    if (desc) 
    {
        *len =  USBD_GetLen(desc) * 2 + 2;    
        unicode[idx++] = *len;
        unicode[idx++] = STRING_TYPE;
        
        while (*desc != '\0') 
        {
            unicode[idx++] = *desc++;
            unicode[idx++] =  0x00;
        }
    } 
}

static uint8_t USB_BufferDescTable(uint8_t ep, uint16_t addr, uint16_t count)
{
    uint16_t bCount     = 0;

    // Ghi các giá trị vào thành ghi ADDRn_TX/ADDRn_RX để ngoại vi biết dữ liệu
    // sẽ được lưu và nhận tại đâu.

    if ((ep & 0x80) != RESET)   // Transmission
    {
        ep = ep & 0x0F;
        USB_ADDR_TX(ep) = addr;
        SetMaxPacketOutEP(ep, count);
    }
    else                        // Reception
    {
        ep = ep & 0x0F;

        if (count > 62U)
        {
            bCount = count >> 6U;
            bCount = bCount << 10;
            bCount = bCount | 0x8000;   // Set BL_SIZE
        }
        else
        {
            bCount = (count + 1U) >> 1U;            
            bCount = bCount << 10;
        }

        USB_ADDR_RX(ep) = addr;
        USB_COUNT_RX(ep) = bCount;
    }
    
    return 0;
}

static void USB_EndpointInit(USB_Typedef* USBx, uint8_t type, uint8_t addr, uint16_t packetAddr, uint16_t maxPacketSize)
{
    // Set endpoint type
    uint8_t ep = 0;

    ep = addr & 0x7FU;
    USB_SET_TYPE_TRANSFER(USBx, ep, type);
    USB_SET_ENDPOINT_ADDRESS(USBx, ep);

    if ((addr & 0x80) == 0x80)      // IN endpoint
    {
        // Set bit STAT_TX và clear DTOG_TX
        USB_SET_STAT_TX(USBx, ep, STATUS_TX_NAK);
        USB_DATA_TGL_TX(USBx, ep, DATA_TGL_0);
    }
    else
    {
        // Set bit STAT_RX và clear DTOG_RX
        USB_SET_STAT_RX(USBx, ep, STATUS_RX_VALID);
        USB_DATA_TGL_RX(USBx, ep, DATA_TGL_0);
    }

    USB_BufferDescTable(addr, packetAddr, maxPacketSize);
}

static void USB_ProcessSetupStage(USB_Typedef* USBx, uint8_t *buff)
{
    uint16_t            length = 0;
    uint8_t             descType = 0;
    uint8_t             descIdx = 0;
    uint8_t             *bufftmp = NULL;

    ControlState = 0;       /* Default: Next stage is data stage and direction is IN */
    DevRequest = *((USB_RequestTypedef*) buff);
    descType = (uint8_t) ((DevRequest.wValue >> 8) & 0xFF);
    descIdx  = (uint8_t) (DevRequest.wValue & 0xFF);

