Leminuos/redirect_to_ram/HAL/src/stm32_hal_usb.c
    if (DevRequest.bmRequestType.bits.type != RESET)
    {
        if (DevRequest.bmRequestType.bits.type == USB_REQ_TYP_CLASS)
        {
            switch (DevRequest.bRequest)
            {
                #ifdef SUPPORT_USB_CDC
                case CDC_GET_LINE_CODING:
                    bCount = MAX_SIZE_COM_CONFIG;
                    buffin = (uint8_t*)&CDC_LineCoding;
                    USB_ReadPMA(USBx, USB_ADDR0_RX, EP0_buffer, USB_COUNT0_RX & 0x3FF);
                    break;

                case CDC_SET_LINE_CODING:
                    ControlState = ControlState | 0x02; /* Next OUT direction */
                    break;

                case CDC_SET_LINE_CTLSTE:
                    break;

                case CDC_SEND_BREAK:
                    break;
                #endif /* SUPPORT_USB_CDC */

                #ifdef SUPPORT_USB_HID
                case HID_SET_REPORT:
                    ControlState = ControlState | 0x02; /* Next OUT direction */
                    break;
                #endif /* SUPPORT_USB_HID */

                default:
                    ControlState = ControlState | 0x80;
                    break;
            }
        }
        else if (DevRequest.bmRequestType.bits.type == USB_REQ_TYP_VENDOR)
        {
            /* Manufacturer request */
        }
        else
        {
            ControlState = ControlState | 0x80;
        }
    }
    else
    {
        switch (DevRequest.bRequest)
        {
            case GET_DESCRIPTOR:    
                if (descType == DEVICE_TYPE)
                {
                    bCount = MAX_SIZE_DEVICE_DESCRIPTOR;
                    buffin = DeviceDesc;
                }
                else if (descType == CONFIGURATION_TYPE)
                {
                    bCount = DevRequest.wLength < USB_CONFIG_DESC_LEN ? DevRequest.wLength : USB_CONFIG_DESC_LEN;
                    buffin = ConfigDesc;
                }
                else if (descType == DEVICE_QUALIFIER_TYPE)
                {
                    bCount      = 0;
                    buffin      = NULL;
                    ControlState = ControlState | 0x80;
                }
                #ifdef SUPPORT_USB_HID
                else if (descType == REPORT_DESCRIPTOR_TYPE)
                {
                    bCount = DevRequest.wLength;
                    buffin = reportDescriptor;
                }
                #endif /* SUPPORT_USB_HID */
                else if (descType == STRING_TYPE)
                {
                    // USB Language Identifiers
                    // http://www.baiheee.com/Documents/090518/090518112619/USB_LANGIDs.pdf

                    switch (descIdx)
                    {
                        case USBD_IDX_LANGID_STR:
                            bCount = USB_LEN_LANGID_STR_DESC;
                            buffin = LangIDDesc;
                            break;

                        case USBD_IDX_MFC_STR:
                            USB_GetString((uint8_t *)USBD_MANUFACTURER_STRING, StrDesc, &length);
                            bCount = length;
                            buffin = StrDesc;
                            break;

                        case USBD_IDX_PRODUCT_STR:
                            USB_GetString((uint8_t *)USBD_PRODUCT_STRING_FS, StrDesc, &length);
                            bCount = length;
                            buffin = StrDesc;
                            break;

                        case USBD_IDX_SERIAL_STR:
                            USB_GetString((uint8_t *)USBD_SERIALNUMBER_STRING_FS, StrDesc, &length);
                            bCount = length;
                            buffin = StrDesc;
                            break;

                        case USBD_IDX_CONFIG_STR:
                            USB_GetString((uint8_t *)USBD_CONFIGURATION_STRING_FS, StrDesc, &length);
                            bCount = length;
                            buffin = StrDesc;
                            break;

                        case USBD_IDX_INTERFACE_STR:
                            USB_GetString((uint8_t *)USBD_INTERFACE_STRING_FS, StrDesc, &length);
                            bCount = length;
                            buffin = StrDesc;
                            break;

                        default:
                            bCount      = 0;
                            buffin      = NULL;
                            ControlState = ControlState | 0x80;
                            break;
                    }
                }
                else
                {
                    ControlState = ControlState | 0x80;
                }

                break;
            
            case SET_ADDRESS:
                ControlState = ControlState | 0x01;     /* Next Status Stage */
                u8Address   = DevRequest.wValue & 0xFF;
                bCount      = 0;    // Reset count khi nhận được request SET_ADDRESS
                                    // Nếu không sẽ gặp lỗi không thể set được address
                buffin      = NULL;
                break;

            case GET_CONFIGURATION:
                EP0_buffer[0]   = config;
                buffin          = EP0_buffer;
                bCount          = 1;
                break;
            
            case SET_CONFIGURATION:
                config      = DevRequest.wValue & 0xFF;
                
                #ifdef SUPPORT_USB_CDC
                USB_EndpointInit(USB, ENDPOINT_TYPE_BULK, CDC_IN_EP, 0xC0, CDC_DATA_FS_IN_PACKET_SIZE);
                USB_EndpointInit(USB, ENDPOINT_TYPE_BULK, CDC_OUT_EP, 0x110, CDC_DATA_FS_OUT_PACKET_SIZE);
                USB_EndpointInit(USB, ENDPOINT_TYPE_INTERRUPT, CDC_CMD_EP, 0x100, CDC_CMD_PACKET_SIZE);
                #endif /* SUPPORT_USB_CDC */

                #ifdef SUPPORT_USB_HID
                USB_EndpointInit(USB, ENDPOINT_TYPE_INTERRUPT, HID_IN_EP, 0xC0, HID_MAX_SIZE_REPORT);
                #endif /* SUPPORT_USB_HID */

                USB_ENUM_OK = 1;
                break;

            case CLEAR_FEATURE:
                if (DevRequest.bmRequestType.bits.recipient == USB_REQ_RECIP_DEVICE)
                {
                    if ((DevRequest.wValue & 0xFF) == 0x01)
                    {
                        if (ConfigDesc[7] & 0x20)
                        {
                            // wake up
                        }
                        else ControlState = ControlState | 0x80;
                    }
                    else ControlState = ControlState | 0x80;
                }
                else if (DevRequest.bmRequestType.bits.recipient == USB_REQ_RECIP_ENDP)
                {
                    switch (DevRequest.wIndex & 0xFF)
                    {
                        case 0x01:      // EP1 OUT
                            break;
                        
                        case 0x81:      // EP1 IN
                            break;

