Leminuos/redirect_to_ram/HAL/src/stm32_hal_usb.c
                        case 0x02:      // EP2 OUT
                            break;
                        
                        case 0x82:      // EP2 IN
                            break;

                        case 0x03:      // EP3 OUT
                            break;
                        
                        case 0x83:      // EP3 IN
                            break;

                        default:
                            ControlState = ControlState | 0x80;
                            break;
                    }
                }
                else ControlState = ControlState | 0x80;
                break;

            case SET_FEATURE:
                if (DevRequest.bmRequestType.bits.recipient == USB_REQ_RECIP_DEVICE)
                {
                    if ((DevRequest.wValue & 0xFF) == 0x01)
                    {
                        if (ConfigDesc[7] & 0x20)
                        {
                            // wake up
                        }
                        else ControlState = ControlState | 0x80;
                    }
                    else ControlState = ControlState | 0x80;
                }
                else if (DevRequest.bmRequestType.bits.recipient == USB_REQ_RECIP_ENDP)
                {
                    switch (DevRequest.wIndex & 0xFF)
                    {
                        case 0x01:      // EP1 OUT
                            break;
                        
                        case 0x81:      // EP1 IN
                            break;

                        case 0x02:      // EP2 OUT
                            break;
                        
                        case 0x82:      // EP2 IN
                            break;

                        case 0x03:      // EP3 OUT
                            break;
                        
                        case 0x83:      // EP3 IN
                            break;

                        default:
                            ControlState = ControlState | 0x80;
                            break;
                    }
                }
                else ControlState = ControlState | 0x80;
                break;

            case GET_INTERFACE:
                break;
            
            case SET_INTERFACE:
                break;

            case GET_STATUS:
                EP0_buffer[0]   = 0x00;
                EP0_buffer[1]   = 0x00;
                bCount          = 2;
                buffin          = EP0_buffer;
                break;
            
            case SET_DESCRIPTOR:
                break;

            default:
                break;
        }
    }

    if ((ControlState & 0x80) == 0x80)     // Stall
    {
        ControlState = ControlState & ~0x80;
        USB_SET_STAT_TX(USBx, 0, STATUS_TX_STALL);
        USB_SET_STAT_RX(USBx, 0, STATUS_RX_STALL);
        return;
    }

    if ((ControlState & 0x02) != 0x02)      // Next IN Direction
    {
        bufftmp = buffin;

        if ((ControlState & 0x01) != 0x01)      // Next Data Stage
        {
            if (bCount > GetMaxPacketOutEP(0))
            {
                USB_COUNT0_TX   = GetMaxPacketOutEP(0);
                bCount          = bCount - GetMaxPacketOutEP(0);
                buffin          = buffin + GetMaxPacketOutEP(0);
                ControlState    = ControlState | 0x40;
            }
            else
            {
                USB_COUNT0_TX = bCount;
                bCount = 0;
                buffin = NULL;
            }
            
            USB_WritePMA(USBx, USB_ADDR0_TX, bufftmp, USB_COUNT0_TX & 0x3FF);
        }

        // Phải modify cả thanh ghi chứ từng bit riêng lẻ sẽ không đúng với các bit toggle
        // Cho phép transmit, DTOG_TX = 1 => Truyền DATA1
        // Vì Status Stage là DATA1 => DTOG_RX = 1 để cho phép nhận DATA1
        
        USB_SET_STAT_TX(USBx, 0, STATUS_TX_VALID);
        USB_DATA_TGL_TX(USBx, 0, DATA_TGL_1);
    }
    else                                   // Next OUT Direction
    {
        USB_SET_STAT_RX(USBx, 0, STATUS_RX_VALID);
        USB_DATA_TGL_RX(USBx, 0, DATA_TGL_1);
    }
}

static void USB_ProcessDataInStage(USB_Typedef* USBx, uint8_t ep)
{
    uint8_t     *bufftmp;

    if ((ControlState & 0x01) != 0x01)          /* Data Stage */
    {
        bufftmp         = buffin;

        if (bCount > GetMaxPacketOutEP(ep))
        {
            USB_COUNT_TX(ep) = GetMaxPacketOutEP(ep);
            bCount = bCount - GetMaxPacketOutEP(ep);
            buffin = buffin + GetMaxPacketOutEP(ep);
            USB_SET_STAT_RX(USBx, ep, STATUS_RX_NAK);
            USB_SET_STAT_TX(USBx, ep, STATUS_TX_VALID);
            USB_WritePMA(USBx, USB_ADDR_TX(ep), bufftmp, USB_COUNT_TX(ep) & 0x3FF);
        }
        else
        {
            USB_COUNT_TX(ep) = bCount;
            bCount = 0;
            buffin = NULL;

            ControlState = ControlState & ~0x08;

            if ((ControlState & 0x40) == 0x40)
            {
                ControlState = ControlState & ~0x40;
                USB_SET_STAT_RX(USBx, ep, STATUS_RX_NAK);
                USB_SET_STAT_TX(USBx, ep, STATUS_TX_VALID);
                USB_WritePMA(USBx, USB_ADDR_TX(ep), bufftmp, USB_COUNT_TX(ep) & 0x3FF);
            }
            else
            {
                ControlState = ControlState | 0x03;  /* Next Status Stage and OUT direction */
                USB_SET_STAT_RX(USBx, ep, STATUS_RX_VALID);
                USB_SET_STAT_TX(USBx, ep, STATUS_TX_NAK);
                USB_DATA_TGL_RX(USBx, ep, DATA_TGL_1);
            }
        }
    }
    else                                        /* Status Stage */
    {
        ControlState = 0;

        USB_SET_STAT_RX(USBx, ep, STATUS_RX_VALID);
        USB_SET_STAT_TX(USBx, ep, STATUS_TX_NAK);
        USB_DATA_TGL_RX(USBx, ep, DATA_TGL_0);

        if (u8Address > 0U && bCount == 0) 
        {
            USBx->DADDR.WORD = u8Address | 0x80;
            u8Address = 0;
        }
    }
}

static void USB_ProcessDataOutStage(USB_Typedef* USBx, uint8_t ep)
{
    uint8_t  i;
    uint16_t wLength;
    
    if (ep == 0)                    // Control transfer
    {
        if ((ControlState & 0x01) != 0x01)          /* Data Stage */
        {
            ControlState = ControlState | 0x01;     /* Next Status Stage */
            
            USB_ReadPMA(USBx, USB_ADDR_RX(ep), bufferControl, USB_COUNT_RX(ep) & 0x3FF);

