Leminuos/redirect_to_ram/HAL/src/stm32_hal_usb.c
            #ifdef SUPPORT_USB_CDC
            if (DevRequest.bRequest == CDC_SET_LINE_CODING)
            {
                wLength = DevRequest.wLength > sizeof(CDC_LineCoding) ? sizeof(CDC_LineCoding) : DevRequest.wLength;
                
                for (i = 0; i < wLength; ++i)
                {
                    ((uint8_t*)&CDC_LineCoding)[i] = bufferControl[i];
                }
            }
            #endif /* SUPPORT_USB_CDC */
            #ifdef SUPPORT_USB_HID
            if (DevRequest.bRequest == HID_SET_REPORT)
            {
                if (((DevRequest.wValue >> 8) & 0xFF) == HID_OUTPUT_REPORT)
                {
                    ControlState = ControlState | 0x04;
                    bLength = USB_COUNT_RX(ep) & 0x3FF;
                    USB_ReadPMA(USB, USB_ADDR_RX(ep), buffout, USB_COUNT_RX(ep) & 0x3FF);
                }
            }
            #endif /* SUPPORT_USB_HID */
            
            (void) i;
            (void) wLength;

            USB_SET_STAT_TX(USBx, ep, STATUS_TX_VALID);
            USB_DATA_TGL_TX(USBx, ep, DATA_TGL_1);
            USB_SET_STAT_RX(USBx, ep, STATUS_RX_NAK);
        }
        else                                        /* Status Stage */
        {
            ControlState = 0;

            USB_SET_STAT_RX(USBx, ep, STATUS_RX_VALID);
            USB_DATA_TGL_RX(USBx, ep, DATA_TGL_0);
            USB_SET_STAT_TX(USBx, ep, STATUS_TX_NAK);
        }
    }
    else
    {
        if ((ControlState & 0x04) != 0x04)
        {
            ControlState = ControlState | 0x04;
            bLength = USB_COUNT_RX(ep) & 0x3FF;
            USB_ReadPMA(USB, USB_ADDR_RX(ep), buffout, USB_COUNT_RX(ep) & 0x3FF);
            USB_SET_STAT_RX(USB, ep, STATUS_RX_VALID);
        }
    }
}

void USB_PowerOnReset(void)
{
    /* Peripheral clock enable */
    RCC->APB1ENR.BITS.USBEN = SET;
    
    /*Enable interrupt NVIC */
    NVIC_EnableIRQ(USB_LP_CAN1_RX0_IRQn);
    NVIC_SetPriority(USB_LP_CAN1_RX0_IRQn, 0X01);

    /* Enable interrupt mask */
    USB->CNTR.WORD = 0xBF00;
    
    /* Force reset */
    USB->CNTR.BITS.FRES = 0x01;
    USB->CNTR.BITS.FRES = 0x00;
    USB->ISTR.BITS.RESET = 0x00;

    /*Clear pending interrupts*/
    USB->ISTR.WORD = 0;

    /*Set Btable Address*/
    USB->BTABLE = BTABLE_ADDRESS;

    /* Enable interrupt mask */
    USB->CNTR.WORD = 0xBF00;
}

void USB_ResetCallBack(void)
{
    USB->ISTR.BITS.RESET = 0x00;

    USB_EndpointInit(USB, ENDPOINT_TYPE_CONTROL, 0x80, 0x18, USB_MAX_EP_PACKET_SIZE);
    USB_EndpointInit(USB, ENDPOINT_TYPE_CONTROL, 0x00, 0x58, USB_MAX_EP_PACKET_SIZE);

    USB->DADDR.BITS.EF = 0x01;
    USB->DADDR.BITS.ADD = 0x00;
}

void USB_TransactionCallBack(void)
{
    uint8_t nCounter    = 0;
    uint16_t addr       = 0;

    while (USB->ISTR.BITS.CTR != RESET)
    {
        epindex = USB->ISTR.BITS.EP_ID;
        
        /* Endpoint 0 */
        if (epindex == 0)
        {
            /* DIR bit = Direction of transaction */

            /* DIR = 1 => Out type => CTR_RX bit or both CTR_TX/CTR_RX are set*/   
            if (USB->ISTR.BITS.DIR != RESET)
            {
                // Có khả năng lỗi sẽ phát sinh tại đây, vì tại đây mình đang fix cứng
                // là cả OUT/SETUP token chứ không xét từng trường hợp OUT và SETUP token
                // => Vào case OUT token có thể fail
                // => Lúc đấy có thể check tiếp hoặc thôi :v

                if (USB->EPnRp[epindex].BITS.SETUP != RESET)
                {
                    // Chỉ có thể đọc Reception byte count này khi hoàn thành
                    // OUT/SETUP transaction
                    nCounter = USB_COUNT0_RX & 0x3FF;
                    addr     = USB_ADDR0_RX;

                    USB_ReadPMA(USB, addr, bufferControl, nCounter);

                    CLEAR_TRANSFER_RX_FLAG(USB, epindex);
                    
                    USB_ProcessSetupStage(USB, bufferControl);
                }

                // Đã fix được, do Status Stage nó là Out Token để host gửi ACK cho device
                // mà trước đó mình để code của Out Token rỗng => Sẽ gây ra sai sót liên
                // quan đến STAT_RX và DTOG_RX => Fail
                else
                {
                    if (USB->EPnRp[epindex].BITS.CTR_RX != RESET)
                    {
                        CLEAR_TRANSFER_RX_FLAG(USB, epindex);
                        USB_ProcessDataOutStage(USB, epindex);
                    }
                }
            }
            /* DIR = 0 => IN type => CTR_TX bit is set */
            else
            { 
                // In token
                if (USB->EPnRp[epindex].BITS.CTR_TX != RESET)
                {
                    // Clear bit CTR_TX
                    CLEAR_TRANSFER_TX_FLAG(USB, epindex);
                    USB_ProcessDataInStage(USB, epindex);
                }
            }
        }
        else
        {
            /* DIR bit = Direction of transaction */

            /* DIR = 1 => Out type => CTR_RX bit or both CTR_TX/CTR_RX are set*/   
            if (USB->ISTR.BITS.DIR != RESET)
            {
                // Out token
                if (USB->EPnRp[epindex].BITS.CTR_RX != RESET)
                {
                    CLEAR_TRANSFER_RX_FLAG(USB, epindex);                 
                    USB_ProcessDataOutStage(USB, epindex);
                }
            }
            /* DIR = 0 => IN type => CTR_TX bit is set */
            else
            {
                // In token

                if (USB->EPnRp[epindex].BITS.CTR_TX != RESET)
                {
                    // Clear bit CTR_TX
                    CLEAR_TRANSFER_TX_FLAG(USB, epindex);
                    USB_ProcessDataInStage(USB, epindex);
                }
            }
        }
    }
}

uint8_t USB_Transmit(uint8_t* data, uint8_t length, uint8_t ep)
{
    if (!USB_ENUM_OK) return 0;

    if ((ControlState & 0x08) != 0x08)
    {
        buffin = data;
        bCount = length;
    
        if (bCount > GetMaxPacketOutEP(ep))
        {
            USB_COUNT_TX(ep) = GetMaxPacketOutEP(ep);
            bCount           = bCount - GetMaxPacketOutEP(ep);
            buffin           = buffin + GetMaxPacketOutEP(ep);
            ControlState     = ControlState | 0x40;
        }
        else
        {
            USB_COUNT_TX(ep) = bCount;
            bCount = 0;
            buffin = NULL;
        }
        
        ControlState = ControlState | 0x08;
        USB_WritePMA(USB, USB_ADDR_TX(ep), data, USB_COUNT_TX(ep) & 0x3FF);
        USB_SET_STAT_TX(USB, ep, STATUS_TX_VALID);
        return length;
    }

    return 0;
}

uint16_t USB_Receive(uint8_t* data, uint8_t ep)
{
    if (!USB_ENUM_OK) return 0;

    if ((ControlState & 0x04) == 0x04)
    {
        memcpy(data, buffout, bLength);
        ControlState = ControlState & ~0x04;
        return bLength;
    }

    return 0;
}

